mynamelcz/stm32F4/DEV/sdio_SD/sdio_sd.c
//  /* Enable the SDIO APB2 Clock */
//  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);

//  /* Enable the DMA2 Clock */
//  RCC_AHB1PeriphClockCmd(SD_SDIO_DMA_CLK, ENABLE);
}

/**
  * @brief  Configures the DMA2 Channel4 for SDIO Tx request.
  * @param  BufferSRC: pointer to the source buffer
  * @param  BufferSize: buffer size
  * @retval None
  */
void SD_LowLevel_DMA_TxConfig(u32 *BufferSRC, u32 BufferSize)
{
//  DMA_InitTypeDef SDDMA_InitStructure;

//  DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_FEIF | SD_SDIO_DMA_FLAG_DMEIF | SD_SDIO_DMA_FLAG_TEIF | SD_SDIO_DMA_FLAG_HTIF | SD_SDIO_DMA_FLAG_TCIF);

//  /* DMA2 Stream3  or Stream6 disable */
//  DMA_Cmd(SD_SDIO_DMA_STREAM, DISABLE);

//  /* DMA2 Stream3  or Stream6 Config */
//  DMA_DeInit(SD_SDIO_DMA_STREAM);

//  SDDMA_InitStructure.DMA_Channel = SD_SDIO_DMA_CHANNEL;
//  SDDMA_InitStructure.DMA_PeripheralBaseAddr = (u32)SDIO_FIFO_ADDRESS;
//  SDDMA_InitStructure.DMA_Memory0BaseAddr = (u32)BufferSRC;
//  SDDMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
//  SDDMA_InitStructure.DMA_BufferSize = BufferSize;
//  SDDMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
//  SDDMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
//  SDDMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
//  SDDMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
//  SDDMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
//  SDDMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
//  SDDMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
//  SDDMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
//  SDDMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_INC4;
//  SDDMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_INC4;
//  DMA_Init(SD_SDIO_DMA_STREAM, &SDDMA_InitStructure);
//  DMA_ITConfig(SD_SDIO_DMA_STREAM, DMA_IT_TC, ENABLE);
//  DMA_FlowControllerConfig(SD_SDIO_DMA_STREAM, DMA_FlowCtrl_Peripheral);

//  /* DMA2 Stream3  or Stream6 enable */
//  DMA_Cmd(SD_SDIO_DMA_STREAM, ENABLE);
    
}

/**
  * @brief  Configures the DMA2 Channel4 for SDIO Rx request.
  * @param  BufferDST: pointer to the destination buffer
  * @param  BufferSize: buffer size
  * @retval None
  */
void SD_LowLevel_DMA_RxConfig(u32 *BufferDST, u32 BufferSize)
{
//  DMA_InitTypeDef SDDMA_InitStructure;

//  DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_FEIF | SD_SDIO_DMA_FLAG_DMEIF | SD_SDIO_DMA_FLAG_TEIF | SD_SDIO_DMA_FLAG_HTIF | SD_SDIO_DMA_FLAG_TCIF);

//  /* DMA2 Stream3  or Stream6 disable */
//  DMA_Cmd(SD_SDIO_DMA_STREAM, DISABLE);

//  /* DMA2 Stream3 or Stream6 Config */
//  DMA_DeInit(SD_SDIO_DMA_STREAM);

//  SDDMA_InitStructure.DMA_Channel = SD_SDIO_DMA_CHANNEL;
//  SDDMA_InitStructure.DMA_PeripheralBaseAddr = (u32)SDIO_FIFO_ADDRESS;
//  SDDMA_InitStructure.DMA_Memory0BaseAddr = (u32)BufferDST;
//  SDDMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
//  SDDMA_InitStructure.DMA_BufferSize = BufferSize;
//  SDDMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
//  SDDMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
//  SDDMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
//  SDDMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
//  SDDMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
//  SDDMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
//  SDDMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
//  SDDMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
//  SDDMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_INC4;
//  SDDMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_INC4;
//  DMA_Init(SD_SDIO_DMA_STREAM, &SDDMA_InitStructure);
//  DMA_ITConfig(SD_SDIO_DMA_STREAM, DMA_IT_TC, ENABLE);
//  DMA_FlowControllerConfig(SD_SDIO_DMA_STREAM, DMA_FlowCtrl_Peripheral);

//  /* DMA2 Stream3 or Stream6 enable */
//  DMA_Cmd(SD_SDIO_DMA_STREAM, ENABLE);
}

/** @defgroup STM324x7I_EVAL_SDIO_SD_Private_Functions
  * @{
  */  

/**
  * @brief  DeInitializes the SDIO interface.
  * @param  None
  * @retval None
  */
void SD_DeInit(void)
{ 
  SD_LowLevel_DeInit();
}

/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for data 
  *         transfer).
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_Init(void)
{
  volatile SD_Error errorstatus = SD_OK;
  
  /* SDIO Peripheral Low Level Init */
   SD_LowLevel_Init();
  
  SDIO_DeInit();

  errorstatus = SD_PowerON();

  if (errorstatus != SD_OK)
  {
    /*!< CMD Response TimeOut (wait for CMDSENT flag) */
    return(errorstatus);
  }

  errorstatus = SD_InitializeCards();

  if (errorstatus != SD_OK)
  {
    /*!< CMD Response TimeOut (wait for CMDSENT flag) */
    return(errorstatus);
  }

  /*!< Configure the SDIO peripheral */
  /*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
  /*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
  SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV;
  SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
  SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
  SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
  SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
  SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
  SDIO_Init(&SDIO_InitStructure);

  /*----------------- Read CSD/CID MSD registers ------------------*/
  errorstatus = SD_GetCardInfo(&SDCardInfo);

  if (errorstatus == SD_OK)
  {
    /*----------------- Select Card --------------------------------*/
    errorstatus = SD_SelectDeselect((u32) (SDCardInfo.RCA << 16));
  }

  if (errorstatus == SD_OK)
  {
    errorstatus = SD_EnableWideBusOperation(SDIO_BusWide_4b);
  }  

  return(errorstatus);
}

/**
  * @brief  Gets the cuurent sd card data transfer status.
  * @param  None
  * @retval SDTransferState: Data Transfer state.
  *   This value can be: 
  *        - SD_TRANSFER_OK: No data transfer is acting
  *        - SD_TRANSFER_BUSY: Data transfer is acting
  */
SDTransferState SD_GetStatus(void)
{
  SDCardState cardstate =  SD_CARD_TRANSFER;

